"""
Компоновщик — это структурный паттерн проектирования, который позволяет сгруппировать множество
объектов в древовидную структуру, а затем работать с ней так, как будто это единичный объект.

Пошаговый план реализации

Создать базовый интерфейс (абстрактный класс) Component с общими методами
Реализовать класс Leaf (лист) — простой объект без потомков
Реализовать класс Composite (композит) — объект-контейнер, который хранит дочерние элементы
В Composite добавить методы для управления дочерними элементами (add, remove, get_children)
В Composite реализовать делегирование операций дочерним элементам (рекурсивный обход)
Клиентский код работает через общий интерфейс Component, не различая листья и композиты

Главное преимущество:
Клиентский код не знает и не должен знать, с чем он работает — с простым объектом (Leaf)
или группой объектов (Composite).

Достоинства и недостатки
✅ Достоинства:

Единообразие: работа с простыми и сложными объектами через один интерфейс
Гибкость: легко добавлять новые типы компонентов
Упрощение клиентского кода: не нужно проверять тип объекта
Естественное представление иерархий: деревья, меню, организационные структуры

❌ Недостатки:

Излишняя общность: иногда сложно ограничить типы дочерних элементов (например, если папка должна
 содержать только файлы определённого типа)
Усложнение дизайна: для простых случаев может быть избыточным
Сложность отладки: рекурсивные структуры труднее отслеживать


Где применяется на практике

Файловые системы: файлы и папки
Графические редакторы: примитивы (круг, линия) и группы фигур
UI-компоненты: кнопки, панели, окна (React, Flutter)
Организационные структуры: отделы компании, сотрудники
Меню и навигация: пункты меню и подменю
Системы расчётов: простые продукты и наборы/комплекты
"""

from abc import ABC, abstractmethod
from typing import List


class Employee(ABC):
	"""Базовый интерфейс для всех сотрудников (Component)"""

	def __init__(self, name: str, position: str, salary: int):
		self.name = name
		self.position = position
		self.salary = salary

	@abstractmethod
	def get_salary(self) -> int:
		"""Получить зарплату (для сотрудника или всего отдела)"""
		pass

	@abstractmethod
	def show_details(self, indent: int = 0) -> None:
		"""Показать информацию о сотруднике/отделе"""
		pass


class Developer(Employee):
	"""Разработчик - простой элемент (Leaf)"""

	def __init__(self, name: str, salary: int, programming_language: str):
		super().__init__(name, "Developer", salary)
		self.programming_language = programming_language

	def get_salary(self) -> int:
		return self.salary

	def show_details(self, indent: int = 0) -> None:
		spacing = "  " * indent
		print(f"{spacing}👨‍💻 {self.name} | {self.position} | "
			  f"Язык: {self.programming_language} | "
			  f"Зарплата: {self.salary:,} ₽")


class Designer(Employee):
	"""Дизайнер - простой элемент (Leaf)"""

	def __init__(self, name: str, salary: int, design_tool: str):
		super().__init__(name, "Designer", salary)
		self.design_tool = design_tool

	def get_salary(self) -> int:
		return self.salary

	def show_details(self, indent: int = 0) -> None:
		spacing = "  " * indent
		print(f"{spacing}🎨 {self.name} | {self.position} | "
			  f"Инструмент: {self.design_tool} | "
			  f"Зарплата: {self.salary:,} ₽")


class Department(Employee):
	"""Отдел - составной элемент (Composite)"""

	def __init__(self, name: str, manager_salary: int):
		super().__init__(name, "Department Head", manager_salary)
		self._employees: List[Employee] = []

	def add(self, employee: Employee) -> None:
		"""Добавить сотрудника в отдел"""
		self._employees.append(employee)

	def remove(self, employee: Employee) -> None:
		"""Удалить сотрудника из отдела"""
		self._employees.remove(employee)

	def get_salary(self) -> int:
		"""Получить общую зарплату отдела (руководитель + все подчинённые)"""
		total = self.salary  # Зарплата руководителя
		for employee in self._employees:
			total += employee.get_salary()  # Рекурсивный вызов
		return total

	def show_details(self, indent: int = 0) -> None:
		"""Показать структуру отдела"""
		spacing = "  " * indent
		print(f"{spacing}🏢 Отдел: {self.name}")
		print(f"{spacing}   Руководитель: {self.position} | "
			  f"Зарплата: {self.salary:,} ₽")
		print(f"{spacing}   Общий бюджет отдела: {self.get_salary():,} ₽")
		print(f"{spacing}   Сотрудников: {len(self._employees)}")
		print(f"{spacing}   ---")

		for employee in self._employees:
			employee.show_details(indent + 1)  # Рекурсивный вызов


# === Использование паттерна ===

if __name__ == "__main__":
	# Создаём простых сотрудников (Листья)
	dev1 = Developer("Алексей", 150_000, "Python")
	dev2 = Developer("Мария", 180_000, "Go")
	dev3 = Developer("Иван", 140_000, "JavaScript")

	designer1 = Designer("Ольга", 120_000, "Figma")
	designer2 = Designer("Дмитрий", 130_000, "Adobe XD")

	# Создаём отдел разработки (Композит)
	dev_department = Department("Разработка", 250_000)
	dev_department.add(dev1)
	dev_department.add(dev2)
	dev_department.add(dev3)

	# Создаём отдел дизайна (Композит)
	design_department = Department("Дизайн", 200_000)
	design_department.add(designer1)
	design_department.add(designer2)

	# Создаём IT-департамент, который включает оба отдела (Композит композитов!)
	it_department = Department("IT-департамент", 350_000)
	it_department.add(dev_department)
	it_department.add(design_department)

	# Добавляем отдельного сотрудника напрямую в IT-департамент
	tech_lead = Developer("Сергей", 300_000, "System Design")
	it_department.add(tech_lead)

	print("=" * 70)
	print("ОРГАНИЗАЦИОННАЯ СТРУКТУРА КОМПАНИИ")
	print("=" * 70)
	it_department.show_details()

	print("\n" + "=" * 70)
	print(f"ИТОГО: Общий бюджет IT-департамента: {it_department.get_salary():,} ₽")
	print("=" * 70)
