import random, unicodedata

"""Активная программа работает с данными, которые хранятся в запоминающем
устройстве с произвольным доступом (Random Access Memory, RAM). RAM — очень
быстрая память, но дорогая и требующая постоянного питания: если питание пропадет, то все данные,
 которые в ней хранятся, будут утеряны. Жесткие диски медленнее оперативной памяти.
"""

""" Плоские текстовые файлы
Самый простой пример постоянного хранилища — это старый добрый файл, который иногда называют
 еще плоским файлом. Он хорошо работает в том случае, когда у данных очень простая структура
и вы полностью записываете их на диск или считываете с него. Такой подход годится
 для простых текстовых данных.
"""

"""Текстовые файлы, дополненные пробелами В этом формате каждое поле записи имеет фиксированную
длину и при необходимости дополняется до требуемой длины (как правило, пробелами) так, чтобы
все записи имели одинаковый размер. Программист может использовать функцию seek() для перемещения
по файлу, для записи или только для чтения необходимых записей и полей."""





