import string

"""Когда вам нужно написать некий код, самым быстрым решением является кража…из тех источников, 
которые позволяют это делать. Стандартная библиотека Python (http://docs.python.org/3/library) 
широка, глубока и довольно понятна."""
"""Первое место, на которое вы должны обратить внимание, — это каталог пакетов Python 
(Python Package Index, PyPI) (https://pypi.org/)."""
"""Еще один популярный репозиторий — GitHub. Взгляните, какие пакеты Python популярны в данный 
момент (https://github.com/trending?l=python)."""
"""Сайт Popular Python recipes (http://bit.ly/popular-recipes) содержит более 4000 коротких 
программ Python на любую тему"""








